/* 
  Як ви визначите змінну в TypeScript, яка може приймати рядок або число (union type)? 
  І так само визначте змінну, яка може приймати тільки одне з двох рядкових значень: 'enable' або 'disable' (literal type)?
*/
// Для визначення змінної в TypeScript, яка може приймати рядок або число (union type), 
// використовується синтаксис об'єднання типів. Для визначення змінної,
// яка може приймати тільки одне з двох рядкових значень 'enable' або 'disable' (literal type),
// використовується типовий літерал. 

let union: string | number;
let literal: 'enable' | 'disable';
